Revit 2027 API
BuiltInFailures.MassFailures.FloorRecreateFailed Property
 The floor cannot be created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FloorRecreateFailed { get; }
Public Shared ReadOnly Property FloorRecreateFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FloorRecreateFailed {
	FailureDefinitionId^ get ();
}
static member FloorRecreateFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace